// ====================DATA STRUCTURE & ALGORITHOM NOTES=================

// ========TIME COMPLEXITY =========

// O(1) - যখন কোনো প্রোগ্রাম এর  ইনপুট (n) এর উপর অপারেশন সংখ্যা  নির্ভর করে না অর্থাৎ ইনপুট (n) এর মান যেটাই হোক না কেন অপারেশন সংখ্যা কনস্ট্যান্ট থাকে।

// O(n)- যখন কোনো প্রোগ্রাম এর  ইনপুট (n) এর সাথে অপারেশন সংখ্যা সমানুপাতিক বা লিনিয়ার  হার এ বৃদ্ধি পায়। সাধারণত সিঙ্গেল লুপ এর ক্ষেত্রে হয় এবং ওই লুপ  যদি (n) সংখ্যক বার চলে।

// O(n^2)- যখন কোনো প্রোগ্রাম এর  ইনপুট (n) এর সাথে অপারেশন সংখ্যা বর্গানুপাতিক  বা Quadrilateral  হার এ বৃদ্ধি পায়। সাধারণত ডাবল  লুপ এর ক্ষেত্রে হয় এবং ২ টি  লুপই   যদি (n) সংখ্যক বার চলে।

// O(n^3)- যখন কোনো প্রোগ্রাম এর  ইনপুট (n) এর সাথে অপারেশন সংখ্যা ৩ গুন  হার এ বৃদ্ধি পায়। সাধারণত ডাবল  লুপ এর ক্ষেত্রে হয় এবং ৩ টি  লুপই   যদি (n) সংখ্যক বার চলে।
